#Titanic Dataset

La tarea de esta semana consiste en preprocesar el dataset del Titanic, puede consultar la imagen "Diccionario de datos" para mayor detalle sobre los atributos utilizados

In [0]:
import pandas as pd
import numpy as np

###1. Importar el archivo "titanic-data.csv" con la librería pandas y mostrar los 5 primeros datos

In [9]:
data = pd.read_csv("titanic-data.csv")
data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

###2. Revise cuantos datos faltantes existen en el dataset

In [10]:
#Funcion .isnull( )
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

###3. Completando las edades faltantes:

####3a. Los datos de la columna "Age" que no contienen datos los completaremos con -0.5

In [0]:
#Funcion .fillna( )
data['Age'] = data['Age'].fillna(-0.5)

####3b. Clasificaremos las edades en los siguientes intervalos:

Unknown: -1 - 0

Baby: 0 - 5

Child: 5 - 12

Teenager: 12 - 18

Student: 18 - 25

Young Adult: 25 - 35

Adult: 35 - 60

Senior: 60 - 120

In [0]:
bins = (-1, 0, 5, 12, 18, 25, 35, 60, 120)
group_names = ['Unknown', 'Baby', 'Child', 'Teenager', 'Student', 'Young Adult', 'Adult', 'Senior']
categories = pd.cut(data['Age'], bins, labels=group_names)
data['Edad'] = categories

####3c. Eliminamos la columna "Age", los datos ya no son necesarios

In [0]:
del data['Age']

###4. Simplificando las tarifas (Fare):

####4a. Al no contar con una clasificación determinada para la columna "Fare", utilizaremos los intervalos que nos proporciona los cuartiles. ¿Cúales son esos intervalos?

In [14]:
data['Fare'].describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

####4b. Ahora que tenemos los intervalos, clasificaremos la data "Fare", utilice nombres a su criterio

In [0]:
bins = (0, 8, 15, 31, 513)
group_names = ['1_quartile', '2_quartile', '3_quartile', '4_quartile']
categories = pd.cut(data['Fare'], bins, labels=group_names,include_lowest=True)
data['Tarifa'] = categories

####4c. La columna "Fare" ya no es necesaria

In [0]:
del data['Fare']

###5. Dando formato a "Name"

####5a. En la columna "Name" solo es necesario el apellido y el prefijo que acompaña el nombre (Mr.)

Ejecutaremos el siguiente código para crear nuevas columnas con esa información:

In [0]:
#Reemplazar "data" por el nombre de su dataset
apellido = data['Name'].apply(lambda x: x.split(',')[0])
data['Lname'] = apellido

.apply( ) -> Función de Pandas que ejecuta una función por cada elemento, en este caso por cada elemento de la columna "Name"

lambda -> Crea una función de una línea con la variable x

x.split('  ') -> Corta un texto con el caracter entre paréntesis

Ejecutando el código en una linea:

[Braund,  Mr. Owen Harris]

Se crea una lista, se selecciona lo que queremos en este caso el apellido se encuentra en la primera posición, por ese motivo colocamos [0]

In [0]:
nombre = data['Name'].apply(lambda x: x.split(',')[1])
titulo = nombre.apply(lambda x: x.split('.')[0])
data['NamePrefix'] = titulo

In [19]:
data['NamePrefix'].value_counts()

 Mr              517
 Miss            182
 Mrs             125
 Master           40
 Dr                7
 Rev               6
 Major             2
 Mlle              2
 Col               2
 Capt              1
 the Countess      1
 Ms                1
 Jonkheer          1
 Mme               1
 Sir               1
 Lady              1
 Don               1
Name: NamePrefix, dtype: int64

####5b. La columna "Name" ya no es necesaria

In [0]:
del data['Name']

###6. Completando datos faltantes en "Embarked"

Como hemos visto al comienzo del cuaderno, son 2 los datos faltantes en la columna "Embarked", como son letras no podemos llenarlo con la media, para eso completaremos estos datos con la letra que tenga mayor número de datos

####6a. Halle la letra que tiene más valores en la columna "Embarked"

In [21]:
data['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

####6b. Complete los datos faltantes con la letra hallada en la pregunta anterior

In [0]:
data['Embarked'] = data['Embarked'].fillna('S')

###7. ¿Deberian considerarse todos los campos del dataset para analizar la información posteriormente? Justifique

####8. Según lo respondido en la pregunta anterior: Elimine las columnas de los datos que no serán relevantes para nuestro análisis

In [23]:
data.head()

   PassengerId  Survived  Pclass  ...      Tarifa      Lname  NamePrefix
0            1         0       3  ...  1_quartile     Braund          Mr
1            2         1       1  ...  4_quartile    Cumings         Mrs
2            3         1       3  ...  1_quartile  Heikkinen        Miss
3            4         1       1  ...  4_quartile   Futrelle         Mrs
4            5         0       3  ...  2_quartile      Allen          Mr

[5 rows x 13 columns]

In [0]:
del data['PassengerId']
del data['Ticket']
del data['Cabin']

In [25]:
data.head()

   Survived  Pclass     Sex  ...      Tarifa      Lname NamePrefix
0         0       3    male  ...  1_quartile     Braund         Mr
1         1       1  female  ...  4_quartile    Cumings        Mrs
2         1       3  female  ...  1_quartile  Heikkinen       Miss
3         1       1  female  ...  4_quartile   Futrelle        Mrs
4         0       3    male  ...  2_quartile      Allen         Mr

[5 rows x 10 columns]

**Con esto nuestra data estaría limpia y lista para el análisis**

#Label Encoding

Codifica las etiquetas de destino con un valor entre 0 y n_classes-1.

###Mapear 'Sex'

In [0]:
from sklearn import preprocessing

In [0]:
le = preprocessing.LabelEncoder() 
le = le.fit(data['Sex'])
data['Sex'] = le.transform(data['Sex'])

In [28]:
data['Sex'].value_counts()

1    577
0    314
Name: Sex, dtype: int64

In [29]:
data.head()

   Survived  Pclass  Sex  SibSp  ...         Edad      Tarifa      Lname NamePrefix
0         0       3    1      1  ...      Student  1_quartile     Braund         Mr
1         1       1    0      1  ...        Adult  4_quartile    Cumings        Mrs
2         1       3    0      0  ...  Young Adult  1_quartile  Heikkinen       Miss
3         1       1    0      1  ...  Young Adult  4_quartile   Futrelle        Mrs
4         0       3    1      0  ...  Young Adult  2_quartile      Allen         Mr

[5 rows x 10 columns]

###Invertir Transformación

In [0]:
data['Sex'] = le.inverse_transform(data['Sex'])

In [31]:
data.head()

   Survived  Pclass     Sex  ...      Tarifa      Lname NamePrefix
0         0       3    male  ...  1_quartile     Braund         Mr
1         1       1  female  ...  4_quartile    Cumings        Mrs
2         1       3  female  ...  1_quartile  Heikkinen       Miss
3         1       1  female  ...  4_quartile   Futrelle        Mrs
4         0       3    male  ...  2_quartile      Allen         Mr

[5 rows x 10 columns]

###Diccionario de Mapeado

In [32]:
le_name_mapping = dict(zip(le.classes_, le.transform(le.classes_)))
print(le_name_mapping)

{'female': 0, 'male': 1}

###Mapeado de Edad

In [0]:
lEdad = preprocessing.LabelEncoder() 
lEdad = lEdad.fit(data['Edad'])
data['Edad'] = lEdad.transform(data['Edad'])

In [34]:
data['Edad'].value_counts()

7    196
0    195
6    177
4    162
5     70
1     44
2     25
3     22
Name: Edad, dtype: int64

In [35]:
data.head()

   Survived  Pclass     Sex  SibSp  ...  Edad      Tarifa      Lname NamePrefix
0         0       3    male      1  ...     4  1_quartile     Braund         Mr
1         1       1  female      1  ...     0  4_quartile    Cumings        Mrs
2         1       3  female      0  ...     7  1_quartile  Heikkinen       Miss
3         1       1  female      1  ...     7  4_quartile   Futrelle        Mrs
4         0       3    male      0  ...     7  2_quartile      Allen         Mr

[5 rows x 10 columns]

In [36]:
Edad_Mapeado = dict(zip(lEdad.classes_, lEdad.transform(lEdad.classes_)))
print(Edad_Mapeado)

{'Adult': 0, 'Baby': 1, 'Child': 2, 'Senior': 3, 'Student': 4, 'Teenager': 5, 'Unknown': 6, 'Young Adult': 7}

Mapeo de sexo

In [0]:
lSex = preprocessing.LabelEncoder() 
lSex = lSex.fit(data['Sex'])
data['Sex'] = lSex.transform(data['Sex'])

In [39]:
data['Sex'].value_counts()

1    577
0    314
Name: Sex, dtype: int64

In [40]:
data.head()

   Survived  Pclass  Sex  SibSp  ...  Edad      Tarifa      Lname NamePrefix
0         0       3    1      1  ...     4  1_quartile     Braund         Mr
1         1       1    0      1  ...     0  4_quartile    Cumings        Mrs
2         1       3    0      0  ...     7  1_quartile  Heikkinen       Miss
3         1       1    0      1  ...     7  4_quartile   Futrelle        Mrs
4         0       3    1      0  ...     7  2_quartile      Allen         Mr

[5 rows x 10 columns]

In [41]:
Sex_Mapeado = dict(zip(lSex.classes_, lSex.transform(lSex.classes_)))
print(Sex_Mapeado)

{'female': 0, 'male': 1}

Mapeo Tarifa

In [0]:
lTarifa = preprocessing.LabelEncoder() 
lTarifa = lTarifa.fit(data['Tarifa'])
data['Tarifa'] = lTarifa.transform(data['Tarifa'])

In [43]:
data['Tarifa'].value_counts()

0    241
3    222
1    217
2    211
Name: Tarifa, dtype: int64

In [44]:
data.head()

   Survived  Pclass  Sex  SibSp  ...  Edad Tarifa      Lname  NamePrefix
0         0       3    1      1  ...     4      0     Braund          Mr
1         1       1    0      1  ...     0      3    Cumings         Mrs
2         1       3    0      0  ...     7      0  Heikkinen        Miss
3         1       1    0      1  ...     7      3   Futrelle         Mrs
4         0       3    1      0  ...     7      1      Allen          Mr

[5 rows x 10 columns]

In [46]:
Tarifa_Mapeado = dict(zip(lTarifa.classes_, lTarifa.transform(lTarifa.classes_)))
print(Tarifa_Mapeado)

{'1_quartile': 0, '2_quartile': 1, '3_quartile': 2, '4_quartile': 3}

Mapeo_Lname

In [0]:
lLname = preprocessing.LabelEncoder() 
lLname = lLname.fit(data['Lname'])
data['Lname'] = lLname.transform(data['Lname'])

In [48]:
data['Lname'].value_counts()

16     9
532    7
563    6
292    6
464    6
      ..
419    1
418    1
417    1
416    1
0      1
Name: Lname, Length: 667, dtype: int64

In [49]:

data.head()

   Survived  Pclass  Sex  SibSp  Parch Embarked  Edad  Tarifa  Lname NamePrefix
0         0       3    1      1      0        S     4       0     73         Mr
1         1       1    0      1      0        C     0       3    136        Mrs
2         1       3    0      0      0        S     7       0    251       Miss
3         1       1    0      1      0        S     7       3    198        Mrs
4         0       3    1      0      0        S     7       1     11         Mr

In [50]:
Lname_Mapeado = dict(zip(lLname.classes_, lLname.transform(lLname.classes_)))
print(Lname_Mapeado)

{'Abbing': 0, 'Abbott': 1, 'Abelson': 2, 'Adahl': 3, 'Adams': 4, 'Ahlin': 5, 'Aks': 6, 'Albimona': 7, 'Alexander': 8, 'Alhomaki': 9, 'Ali': 10, 'Allen': 11, 'Allison': 12, 'Allum': 13, 'Andersen-Jensen': 14, 'Anderson': 15, 'Andersson': 16, 'Andreasson': 17, 'Andrew': 18, 'Andrews': 19, 'Angle': 20, 'Appleton': 21, 'Arnold-Franchi': 22, 'Artagaveytia': 23, 'Asim': 24, 'Asplund': 25, 'Astor': 26, 'Attalah': 27, 'Aubart': 28, 'Augustsson': 29, 'Ayoub': 30, 'Backstrom': 31, 'Baclini': 32, 'Badt': 33, 'Bailey': 34, 'Balkic': 35, 'Ball': 36, 'Banfield': 37, 'Barah': 38, 'Barbara': 39, 'Barber': 40, 'Barkworth': 41, 'Barton': 42, 'Bateman': 43, 'Baumann': 44, 'Baxter': 45, 'Bazzani': 46, 'Beane': 47, 'Beavan': 48, 'Becker': 49, 'Beckwith': 50, 'Beesley': 51, 'Behr': 52, 'Bengtsson': 53, 'Berglund': 54, 'Berriman': 55, 'Betros': 56, 'Bidois': 57, 'Bing': 58, 'Birkeland': 59, 'Bishop': 60, 'Bissette': 61, 'Bjornstrom-Steffansson': 62, 'Blackwell': 63, 'Blank': 64, 'Bonnell': 65, 'Bostandyeff': 66, 'Boulos': 67, 'Bourke': 68, 'Bowen': 69, 'Bowerman': 70, 'Bracken': 71, 'Bradley': 72, 'Braund': 73, 'Brewe': 74, 'Brocklebank': 75, 'Brown': 76, 'Bryhl': 77, 'Burke': 78, 'Burns': 79, 'Buss': 80, 'Butler': 81, 'Butt': 82, 'Byles': 83, 'Bystrom': 84, 'Cacic': 85, 'Cairns': 86, 'Calderhead': 87, 'Caldwell': 88, 'Calic': 89, 'Cameron': 90, 'Campbell': 91, 'Canavan': 92, 'Cann': 93, 'Caram': 94, 'Carbines': 95, 'Cardeza': 96, 'Carlsson': 97, 'Carr': 98, 'Carrau': 99, 'Carter': 100, 'Cavendish': 101, 'Celotti': 102, 'Chaffee': 103, 'Chambers': 104, 'Chapman': 105, 'Charters': 106, 'Cherry': 107, 'Chibnall': 108, 'Chip': 109, 'Christmann': 110, 'Christy': 111, 'Chronopoulos': 112, 'Clarke': 113, 'Cleaver': 114, 'Clifford': 115, 'Coelho': 116, 'Cohen': 117, 'Coleff': 118, 'Coleridge': 119, 'Collander': 120, 'Colley': 121, 'Collyer': 122, 'Compton': 123, 'Connaghton': 124, 'Connolly': 125, 'Connors': 126, 'Cook': 127, 'Cor': 128, 'Corn': 129, 'Coutts': 130, 'Coxon': 131, 'Crease': 132, 'Cribb': 133, 'Crosby': 134, 'Culumovic': 135, 'Cumings': 136, 'Cunningham': 137, 'Dahl': 138, 'Dahlberg': 139, 'Dakic': 140, 'Daly': 141, 'Danbom': 142, 'Daniel': 143, 'Danoff': 144, 'Dantcheff': 145, 'Davidson': 146, 'Davies': 147, 'Davis': 148, 'Davison': 149, 'Dean': 150, 'Denkoff': 151, 'Dennis': 152, 'Devaney': 153, 'Dick': 154, 'Dimic': 155, 'Dodge': 156, 'Doharr': 157, 'Doling': 158, 'Dooley': 159, 'Dorking': 160, 'Douglas': 161, 'Dowdell': 162, 'Downton': 163, 'Drazenoic': 164, 'Drew': 165, 'Duane': 166, 'Duff Gordon': 167, 'Duran y More': 168, 'Edvardsson': 169, 'Eitemiller': 170, 'Eklund': 171, 'Ekstrom': 172, 'Elias': 173, 'Elsbury': 174, 'Emanuel': 175, 'Emir': 176, 'Endres': 177, 'Eustis': 178, 'Fahlstrom': 179, 'Farrell': 180, 'Farthing': 181, 'Faunthorpe': 182, 'Fischer': 183, 'Fleming': 184, 'Flynn': 185, 'Foo': 186, 'Ford': 187, 'Foreman': 188, 'Fortune': 189, 'Fox': 190, 'Francatelli': 191, 'Frauenthal': 192, 'Frolicher': 193, 'Frolicher-Stehli': 194, 'Frost': 195, 'Fry': 196, 'Funk': 197, 'Futrelle': 198, 'Fynney': 199, 'Gale': 200, 'Gallagher': 201, 'Garfirth': 202, 'Garside': 203, 'Gaskell': 204, 'Gavey': 205, 'Gee': 206, 'Gheorgheff': 207, 'Giglio': 208, 'Giles': 209, 'Gilinski': 210, 'Gill': 211, 'Gillespie': 212, 'Gilnagh': 213, 'Givard': 214, 'Glynn': 215, 'Goldenberg': 216, 'Goldschmidt': 217, 'Goldsmith': 218, 'Goncalves': 219, 'Goodwin': 220, 'Graham': 221, 'Green': 222, 'Greenberg': 223, 'Greenfield': 224, 'Gronnestad': 225, 'Guggenheim': 226, 'Gustafsson': 227, 'Haas': 228, 'Hagland': 229, 'Hakkarainen': 230, 'Hale': 231, 'Hamalainen': 232, 'Hampe': 233, 'Hanna': 234, 'Hansen': 235, 'Harder': 236, 'Harknett': 237, 'Harmer': 238, 'Harper': 239, 'Harrington': 240, 'Harris': 241, 'Harrison': 242, 'Hart': 243, 'Hassab': 244, 'Hassan': 245, 'Hawksford': 246, 'Hays': 247, 'Healy': 248, 'Hedman': 249, 'Hegarty': 250, 'Heikkinen': 251, 'Heininen': 252, 'Hendekovic': 253, 'Henry': 254, 'Herman': 255, 'Hewlett': 256, 'Hickman': 257, 'Hippach': 258, 'Hirvonen': 259, 'Hocking': 260, 'Hodges': 261, 'Hogeboom': 262, 'Hold': 263, 'Holm': 264, 'Holverson': 265, 'Homer': 266, 'Honkanen': 267, 'Hood': 268, 'Horgan': 269, 'Hosono': 270, 'Hoyt': 271, 'Humblen': 272, 'Hunt': 273, 'Ibrahim Shawah': 274, 'Icard': 275, 'Ilett': 276, 'Ilmakangas': 277, 'Isham': 278, 'Ivanoff': 279, 'Jacobsohn': 280, 'Jalsevac': 281, 'Jansson': 282, 'Jardin': 283, 'Jarvis': 284, 'Jenkin': 285, 'Jensen': 286, 'Jermyn': 287, 'Jerwan': 288, 'Johannesen-Bratthammer': 289, 'Johanson': 290, 'Johansson': 291, 'Johnson': 292, 'Johnston': 293, 'Jonkoff': 294, 'Jonsson': 295, 'Jussila': 296, 'Kallio': 297, 'Kalvik': 298, 'Kantor': 299, 'Karaic': 300, 'Karlsson': 301, 'Karun': 302, 'Kassem': 303, 'Keane': 304, 'Keefe': 305, 'Kelly': 306, 'Kent': 307, 'Kenyon': 308, 'Kiernan': 309, 'Kilgannon': 310, 'Kimball': 311, 'Kink': 312, 'Kink-Heilmann': 313, 'Kirkland': 314, 'Klaber': 315, 'Klasen': 316, 'Knight': 317, 'Kraeff': 318, 'Kvillner': 319, 'Lahoud': 320, 'Lahtinen': 321, 'Laitinen': 322, 'Laleff': 323, 'Lam': 324, 'Landergren': 325, 'Lang': 326, 'Laroche': 327, 'Larsson': 328, 'LeRoy': 329, 'Leader': 330, 'Leeni': 331, 'Lefebre': 332, 'Lehmann': 333, 'Leinonen': 334, 'Leitch': 335, 'Lemberopolous': 336, 'Lemore': 337, 'Lennon': 338, 'Leonard': 339, 'Lester': 340, 'Lesurer': 341, 'Levy': 342, 'Lewy': 343, 'Leyson': 344, 'Lievens': 345, 'Lindahl': 346, 'Lindblom': 347, 'Lindell': 348, 'Lindqvist': 349, 'Lines': 350, 'Ling': 351, 'Lobb': 352, 'Long': 353, 'Longley': 354, 'Louch': 355, 'Lovell': 356, 'Lulic': 357, 'Lundahl': 358, 'Lurette': 359, 'Mack': 360, 'Madigan': 361, 'Madill': 362, 'Madsen': 363, 'Maenpaa': 364, 'Maioni': 365, 'Maisner': 366, 'Mallet': 367, 'Mamee': 368, 'Mangan': 369, 'Mannion': 370, 'Marechal': 371, 'Markoff': 372, 'Markun': 373, 'Marvin': 374, 'Masselmani': 375, 'Matthews': 376, 'Mayne': 377, 'McCarthy': 378, 'McCormack': 379, 'McCoy': 380, 'McDermott': 381, 'McEvoy': 382, 'McGough': 383, 'McGovern': 384, 'McGowan': 385, 'McKane': 386, 'McMahon': 387, 'McNamee': 388, 'Meanwell': 389, 'Meek': 390, 'Mellinger': 391, 'Mellors': 392, 'Meo': 393, 'Mernagh': 394, 'Meyer': 395, 'Millet': 396, 'Milling': 397, 'Minahan': 398, 'Mineff': 399, 'Mionoff': 400, 'Mitchell': 401, 'Mitkoff': 402, 'Mockler': 403, 'Moen': 404, 'Molson': 405, 'Montvila': 406, 'Moor': 407, 'Moore': 408, 'Moran': 409, 'Moraweck': 410, 'Morley': 411, 'Morrow': 412, 'Moss': 413, 'Moubarek': 414, 'Moussa': 415, 'Moutal': 416, 'Mudd': 417, 'Mullens': 418, 'Murdlin': 419, 'Murphy': 420, 'Myhrman': 421, 'Naidenoff': 422, 'Najib': 423, 'Nakid': 424, 'Nankoff': 425, 'Nasser': 426, 'Natsch': 427, 'Navratil': 428, 'Nenkoff': 429, 'Newell': 430, 'Newsom': 431, 'Nicholls': 432, 'Nicholson': 433, 'Nicola-Yarred': 434, 'Nilsson': 435, 'Nirva': 436, 'Niskanen': 437, 'Norman': 438, 'Nosworthy': 439, 'Novel': 440, 'Nye': 441, 'Nysten': 442, 'Nysveen': 443, "O'Brien": 444, "O'Connell": 445, "O'Connor": 446, "O'Driscoll": 447, "O'Dwyer": 448, "O'Leary": 449, "O'Sullivan": 450, 'Odahl': 451, 'Ohman': 452, 'Olsen': 453, 'Olsson': 454, 'Olsvigen': 455, 'Oreskovic': 456, 'Osen': 457, 'Osman': 458, 'Ostby': 459, 'Otter': 460, 'Padro y Manent': 461, 'Pain': 462, 'Palsson': 463, 'Panula': 464, 'Parkes': 465, 'Parr': 466, 'Parrish': 467, 'Partner': 468, 'Pasic': 469, 'Patchett': 470, 'Paulner': 471, 'Pavlovic': 472, 'Pears': 473, 'Peduzzi': 474, 'Pekoniemi': 475, 'Penasco y Castellana': 476, 'Pengelly': 477, 'Perkin': 478, 'Pernot': 479, 'Perreault': 480, 'Persson': 481, 'Peter': 482, 'Peters': 483, 'Petranec': 484, 'Petroff': 485, 'Petterson': 486, 'Pettersson': 487, 'Peuchen': 488, 'Phillips': 489, 'Pickard': 490, 'Pinsky': 491, 'Plotcharsky': 492, 'Ponesell': 493, 'Porter': 494, 'Potter': 495, 'Quick': 496, 'Radeff': 497, 'Razi': 498, 'Reed': 499, 'Reeves': 500, 'Rekic': 501, 'Renouf': 502, 'Reuchlin': 503, 'Reynaldo': 504, 'Rice': 505, 'Richard': 506, 'Richards': 507, 'Ridsdale': 508, 'Ringhini': 509, 'Rintamaki': 510, 'Risien': 511, 'Robbins': 512, 'Robert': 513, 'Robins': 514, 'Roebling': 515, 'Rogers': 516, 'Romaine': 517, 'Rommetvedt': 518, 'Rood': 519, 'Rosblom': 520, 'Ross': 521, 'Rothes': 522, 'Rothschild': 523, 'Rouse': 524, 'Rugg': 525, 'Rush': 526, 'Ryan': 527, 'Ryerson': 528, 'Saad': 529, 'Saalfeld': 530, 'Sadlier': 531, 'Sage': 532, 'Sagesser': 533, 'Salkjelsvik': 534, 'Salonen': 535, 'Samaan': 536, 'Sandstrom': 537, 'Saundercock': 538, 'Sawyer': 539, 'Scanlan': 540, 'Sdycoff': 541, 'Sedgwick': 542, 'Serepeca': 543, 'Seward': 544, 'Sharp': 545, 'Sheerlinck': 546, 'Shellard': 547, 'Shelley': 548, 'Shorney': 549, 'Shutes': 550, 'Silven': 551, 'Silverthorne': 552, 'Silvey': 553, 'Simmons': 554, 'Simonius-Blumer': 555, 'Sinkkonen': 556, 'Sirayanian': 557, 'Sirota': 558, 'Sivic': 559, 'Sivola': 560, 'Sjoblom': 561, 'Sjostedt': 562, 'Skoog': 563, 'Slabenoff': 564, 'Slayter': 565, 'Slemen': 566, 'Slocovski': 567, 'Sloper': 568, 'Smart': 569, 'Smiljanic': 570, 'Smith': 571, 'Sobey': 572, 'Soholt': 573, 'Somerton': 574, 'Spedden': 575, 'Spencer': 576, 'Stahelin-Maeglin': 577, 'Staneff': 578, 'Stankovic': 579, 'Stanley': 580, 'Stead': 581, 'Stephenson': 582, 'Stewart': 583, 'Stone': 584, 'Stoytcheff': 585, 'Strandberg': 586, 'Stranden': 587, 'Strom': 588, 'Sunderland': 589, 'Sundman': 590, 'Sutehall': 591, 'Sutton': 592, 'Svensson': 593, 'Swift': 594, 'Taussig': 595, 'Taylor': 596, 'Thayer': 597, 'Theobald': 598, 'Thomas': 599, 'Thorne': 600, 'Thorneycroft': 601, 'Tikkanen': 602, 'Tobin': 603, 'Todoroff': 604, 'Tomlin': 605, 'Toomey': 606, 'Torber': 607, 'Tornquist': 608, 'Toufik': 609, 'Touma': 610, 'Troupiansky': 611, 'Trout': 612, 'Troutt': 613, 'Turcin': 614, 'Turja': 615, 'Turkula': 616, 'Turpin': 617, 'Uruchurtu': 618, 'Van Impe': 619, 'Van der hoef': 620, 'Vande Velde': 621, 'Vande Walle': 622, 'Vanden Steen': 623, 'Vander Cruyssen': 624, 'Vander Planke': 625, 'Vestrom': 626, 'Vovk': 627, 'Waelens': 628, 'Walker': 629, 'Ward': 630, 'Warren': 631, 'Watson': 632, 'Watt': 633, 'Webber': 634, 'Weir': 635, 'Weisz': 636, 'Wells': 637, 'West': 638, 'Wheadon': 639, 'White': 640, 'Wick': 641, 'Widegren': 642, 'Widener': 643, 'Wiklund': 644, 'Wilhelms': 645, 'Willey': 646, 'Williams': 647, 'Williams-Lambert': 648, 'Windelov': 649, 'Wiseman': 650, 'Woolner': 651, 'Wright': 652, 'Yasbeck': 653, 'Young': 654, 'Youseff': 655, 'Yousif': 656, 'Yousseff': 657, 'Yrois': 658, 'Zabour': 659, 'Zimmerman': 660, 'de Messemaeker': 661, 'de Mulder': 662, 'de Pelsmaeker': 663, 'del Carlo': 664, 'van Billiard': 665, 'van Melkebeke': 666}

mapeado_Nampefix

In [0]:
lNamePrefix= preprocessing.LabelEncoder() 
lNamePrefix = lNamePrefix.fit(data['NamePrefix'])
data['NamePrefix'] = lNamePrefix.transform(data['NamePrefix'])

In [52]:
data['NamePrefix'].value_counts()

11    517
8     182
12    125
7      40
3       7
14      6
1       2
9       2
6       2
4       1
2       1
16      1
5       1
15      1
10      1
13      1
0       1
Name: NamePrefix, dtype: int64

In [53]:
data.head()

   Survived  Pclass  Sex  SibSp  ...  Edad Tarifa  Lname  NamePrefix
0         0       3    1      1  ...     4      0     73          11
1         1       1    0      1  ...     0      3    136          12
2         1       3    0      0  ...     7      0    251           8
3         1       1    0      1  ...     7      3    198          12
4         0       3    1      0  ...     7      1     11          11

[5 rows x 10 columns]

In [54]:
NamePrefix_Mapeado = dict(zip(lNamePrefix.classes_, lNamePrefix.transform(lNamePrefix.classes_)))
print(NamePrefix_Mapeado)

{' Capt': 0, ' Col': 1, ' Don': 2, ' Dr': 3, ' Jonkheer': 4, ' Lady': 5, ' Major': 6, ' Master': 7, ' Miss': 8, ' Mlle': 9, ' Mme': 10, ' Mr': 11, ' Mrs': 12, ' Ms': 13, ' Rev': 14, ' Sir': 15, ' the Countess': 16}

mapeo_enmarke

In [60]:
1Embarked = preprocessing.LabelEncoder() 
lEmbarked = lEmbarked.fit(data['Embarked'])
data['Embarked'] = lEmbarked.transform(data['Embarked'])

SyntaxError: ignored

In [0]:
data['Embarked'].value_counts()

In [0]:
data.head()

In [0]:
Embarked_Mapeado = dict(zip(lEmbarked.classes_, lEmbarked.transform(lEmbarked.classes_)))
print(Embarked_Mapeado)

###Guardando CSV

In [0]:
data.to_csv("modificado.csv",index = False)

In [58]:
data2 = pd.read_csv("modificado.csv")
data2.head()

   Survived  Pclass  Sex  SibSp  ...  Edad Tarifa  Lname  NamePrefix
0         0       3    1      1  ...     4      0     73          11
1         1       1    0      1  ...     0      3    136          12
2         1       3    0      0  ...     7      0    251           8
3         1       1    0      1  ...     7      3    198          12
4         0       3    1      0  ...     7      1     11          11

[5 rows x 10 columns]

#Ejercicios

###¿Cuántas hombres y mujeres hay?

In [0]:
data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

###¿Cuántas personas de la clase 1 sobrevivieron?

In [0]:
data[(data['Pclass']==1 & (data['Survived']==1))].shape[0]

136

###¿Cúal es la familia más numerosa que abordó el titanic?

In [0]:
data['Lname'].value_counts()

Andersson     9
Sage          7
Carter        6
Panula        6
Skoog         6
             ..
Lewy          1
Moutal        1
Willey        1
Augustsson    1
Cherry        1
Name: Lname, Length: 667, dtype: int64

###¿Cúantos Child de la clase 3 sobrevivieron?

In [0]:
data[(data['Edad']=='Child') & (data['Pclass']==3) & (data['Survived']==1)]

     Survived  Pclass   Sex  SibSp  ...   Edad      Tarifa          Lname NamePrefix
125         1       3  male      1  ...  Child  2_quartile  Nicola-Yarred     Master
165         1       3  male      0  ...  Child  3_quartile      Goldsmith     Master
489         1       3  male      1  ...  Child  3_quartile         Coutts     Master
751         1       3  male      0  ...  Child  2_quartile           Moor     Master

[4 rows x 10 columns]

###¿Cúal es el cuartil de Tarifa que tuvo más sobrevivientes?

In [0]:
data[data['Survived']==1]['Tarifa'].value_counts()

4_quartile    129
3_quartile     99
2_quartile     62
1_quartile     51
Name: Tarifa, dtype: int64